/*Operator ตัวดำเนินการ กลุ่มเครื่องหมายหรือสัญลักษณ์ที่ใช้ในการเขียนโปรแกรม เช่น A+B

- operator ตัวดำเนินการ เช่น + - * / %(หารเอาเศษ)
- operand ตัวถูกดำเนินการ

//ตัวดำเนินการทางคณิตศาสตร์ + - * / % **

const A = 20 , B = 3

console.log('ผลบวกของตัวแปร A และ B : ==',A+B)
console.log('ผลลบของตัวแปร A และ B : ==',A-B)
console.log('ผลคูณของตัวแปร A และ B : ==',A*B)
console.log('ผลหารของตัวแปร A และ B : ==',A/B)
console.log('ผลเศษของการหารของตัวแปร A และ B : ==',A%B)
console.log('ผลบวกของตัวแปร A และ B ยกกำลัง(2) : ==',A+B**2)



//ตัวดำเนินการเปรียบเทียบ == != > < >= <= ผลการเปียบเทียบตัวดำเนินการจะได้ค่าเป็น boolean true/false

const A = 10 , B = 20

console.log('ตัวแปร A เท่ากับ B ใช่หรือไม่',A == B) //การแสดงผล False
console.log('ตัวแปร A ไม่เท่ากับ B ใช่หรือไม่',A != B) //True
console.log('ตัวแปร A มากกว่า B ใช่หรือไม่',A > B) //False
console.log('ตัวแปร A น้อยกว่า B ใช่หรือไม่',A < B) //True
console.log('ตัวแปร A มากกว่าหรือเท่ากับ B ใช่หรือไม่',A >= B) //False
console.log('ตัวแปร A น้อยกว่าหรือเท่ากับ B ใช่หรือไม่',A <= B) //True



ตัวดำเนินการทางตรรกศาสตร์ && || ! ใช้ในการเชื่อมเงื่อนไข

AND ค่าที่ได้จะเป็น true เมื่อตัวดำเนินการเป็นจริงทั้งคู่
OR ค่าที่ได้จะเป็น true เมื่อตัวดำเนินการมีฝั่งใดฝั่งหนึ่งเป็นจริง
NOT ค่าที่ได้จะเป็น true เมื่อตัวดำเนินการไม่เป็นจริงทั้งคู่

const A = 10 , B = 20

console.log('ตัวแปร A มีค่าน้อยกว่าตัวแปร B และ&& ตัวแปร B มีค่ามากกว่าตัวแปร A ใช่หรือไม่?',
A < B && B > A) //การแสดงผล True

console.log('ตัวแปร A มีค่ามากกว่าตัวแปร B หรือ|| ตัวแปร B มีค่าน้อยกว่าตัวแปร A ใช่หรือไม่?',
A > B || B < A) //การแสดงผล False
*/





